Model: "sam_model"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_1 (InputLayer)        [(None, 384, 384, 3)]     0         
                                                                 
 block1_conv1 (Conv2D)       (None, 384, 384, 64)      1792      
                                                                 
 block1_conv2 (Conv2D)       (None, 384, 384, 64)      36928     
                                                                 
 block1_pool (MaxPooling2D)  (None, 192, 192, 64)      0         
                                                                 
 block2_conv1 (Conv2D)       (None, 192, 192, 128)     73856     
                                                                 
 block2_conv2 (Conv2D)       (None, 192, 192, 128)     147584    
                                                                 
 block2_pool (MaxPooling2D)  (None, 96, 96, 128)       0         
                                                                 
 block3_conv1 (Conv2D)       (None, 96, 96, 256)       295168    
                                                                 
 block3_conv2 (Conv2D)       (None, 96, 96, 256)       590080    
                                                                 
 block3_conv3 (Conv2D)       (None, 96, 96, 256)       590080    
                                                                 
 block3_pool (MaxPooling2D)  (None, 48, 48, 256)       0         
                                                                 
 block4_conv1 (Conv2D)       (None, 48, 48, 512)       1180160   
                                                                 
 block4_conv2 (Conv2D)       (None, 48, 48, 512)       2359808   
                                                                 
 block4_conv3 (Conv2D)       (None, 48, 48, 512)       2359808   
                                                                 
 block4_pool (MaxPooling2D)  (None, 24, 24, 512)       0         
                                                                 
 block5_conv1 (Conv2D)       (None, 24, 24, 512)       2359808   
                                                                 
 block5_conv2 (Conv2D)       (None, 24, 24, 512)       2359808   
                                                                 
 block5_conv3 (Conv2D)       (None, 24, 24, 512)       2359808   
                                                                 
 block5_pool (MaxPooling2D)  (None, 12, 12, 512)       0         
                                                                 
 global_average_pooling2d (G  (None, 512)              0         
 lobalAveragePooling2D)                                          
                                                                 
 dropout (Dropout)           (None, 512)               0         
                                                                 
 dense (Dense)               (None, 2048)              1050624   
                                                                 
 dropout_1 (Dropout)         (None, 2048)              0         
                                                                 
 dense_1 (Dense)             (None, 2)                 4098      
                                                                 
=================================================================
Total params: 15,769,410
Trainable params: 15,769,410
Non-trainable params: 0
_________________________________________________________________
